zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEdsadc_bf.h
/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH4RUN */
#define IFX_EDSADC_GLOBRC_CH4RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH4RUN */
#define IFX_EDSADC_GLOBRC_CH4RUN_OFF (4u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH5RUN */
#define IFX_EDSADC_GLOBRC_CH5RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH5RUN */
#define IFX_EDSADC_GLOBRC_CH5RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH5RUN */
#define IFX_EDSADC_GLOBRC_CH5RUN_OFF (5u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH6RUN */
#define IFX_EDSADC_GLOBRC_CH6RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH6RUN */
#define IFX_EDSADC_GLOBRC_CH6RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH6RUN */
#define IFX_EDSADC_GLOBRC_CH6RUN_OFF (6u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH7RUN */
#define IFX_EDSADC_GLOBRC_CH7RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH7RUN */
#define IFX_EDSADC_GLOBRC_CH7RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH7RUN */
#define IFX_EDSADC_GLOBRC_CH7RUN_OFF (7u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH8RUN */
#define IFX_EDSADC_GLOBRC_CH8RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH8RUN */
#define IFX_EDSADC_GLOBRC_CH8RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH8RUN */
#define IFX_EDSADC_GLOBRC_CH8RUN_OFF (8u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH9RUN */
#define IFX_EDSADC_GLOBRC_CH9RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH9RUN */
#define IFX_EDSADC_GLOBRC_CH9RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH9RUN */
#define IFX_EDSADC_GLOBRC_CH9RUN_OFF (9u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH10RUN */
#define IFX_EDSADC_GLOBRC_CH10RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH10RUN */
#define IFX_EDSADC_GLOBRC_CH10RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH10RUN */
#define IFX_EDSADC_GLOBRC_CH10RUN_OFF (10u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH11RUN */
#define IFX_EDSADC_GLOBRC_CH11RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH11RUN */
#define IFX_EDSADC_GLOBRC_CH11RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH11RUN */
#define IFX_EDSADC_GLOBRC_CH11RUN_OFF (11u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH12RUN */
#define IFX_EDSADC_GLOBRC_CH12RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH12RUN */
#define IFX_EDSADC_GLOBRC_CH12RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH12RUN */
#define IFX_EDSADC_GLOBRC_CH12RUN_OFF (12u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH13RUN */
#define IFX_EDSADC_GLOBRC_CH13RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH13RUN */
#define IFX_EDSADC_GLOBRC_CH13RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH13RUN */
#define IFX_EDSADC_GLOBRC_CH13RUN_OFF (13u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M0RUN */
#define IFX_EDSADC_GLOBRC_M0RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M0RUN */
#define IFX_EDSADC_GLOBRC_M0RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M0RUN */
#define IFX_EDSADC_GLOBRC_M0RUN_OFF (16u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M1RUN */
#define IFX_EDSADC_GLOBRC_M1RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M1RUN */
#define IFX_EDSADC_GLOBRC_M1RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M1RUN */
#define IFX_EDSADC_GLOBRC_M1RUN_OFF (17u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M2RUN */
#define IFX_EDSADC_GLOBRC_M2RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M2RUN */
#define IFX_EDSADC_GLOBRC_M2RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M2RUN */
#define IFX_EDSADC_GLOBRC_M2RUN_OFF (18u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M3RUN */
#define IFX_EDSADC_GLOBRC_M3RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M3RUN */
#define IFX_EDSADC_GLOBRC_M3RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M3RUN */
#define IFX_EDSADC_GLOBRC_M3RUN_OFF (19u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M4RUN */
#define IFX_EDSADC_GLOBRC_M4RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M4RUN */
#define IFX_EDSADC_GLOBRC_M4RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M4RUN */
#define IFX_EDSADC_GLOBRC_M4RUN_OFF (20u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M5RUN */
#define IFX_EDSADC_GLOBRC_M5RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M5RUN */
#define IFX_EDSADC_GLOBRC_M5RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M5RUN */
#define IFX_EDSADC_GLOBRC_M5RUN_OFF (21u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M6RUN */
#define IFX_EDSADC_GLOBRC_M6RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M6RUN */
#define IFX_EDSADC_GLOBRC_M6RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M6RUN */
#define IFX_EDSADC_GLOBRC_M6RUN_OFF (22u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M7RUN */
#define IFX_EDSADC_GLOBRC_M7RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M7RUN */
#define IFX_EDSADC_GLOBRC_M7RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M7RUN */
#define IFX_EDSADC_GLOBRC_M7RUN_OFF (23u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M8RUN */
#define IFX_EDSADC_GLOBRC_M8RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M8RUN */
#define IFX_EDSADC_GLOBRC_M8RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M8RUN */
#define IFX_EDSADC_GLOBRC_M8RUN_OFF (24u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M9RUN */
#define IFX_EDSADC_GLOBRC_M9RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M9RUN */
#define IFX_EDSADC_GLOBRC_M9RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M9RUN */
#define IFX_EDSADC_GLOBRC_M9RUN_OFF (25u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M10RUN */
#define IFX_EDSADC_GLOBRC_M10RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M10RUN */
#define IFX_EDSADC_GLOBRC_M10RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M10RUN */
#define IFX_EDSADC_GLOBRC_M10RUN_OFF (26u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M11RUN */
#define IFX_EDSADC_GLOBRC_M11RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M11RUN */
#define IFX_EDSADC_GLOBRC_M11RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M11RUN */
#define IFX_EDSADC_GLOBRC_M11RUN_OFF (27u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M12RUN */
#define IFX_EDSADC_GLOBRC_M12RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M12RUN */
#define IFX_EDSADC_GLOBRC_M12RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M12RUN */
#define IFX_EDSADC_GLOBRC_M12RUN_OFF (28u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M13RUN */
#define IFX_EDSADC_GLOBRC_M13RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M13RUN */
#define IFX_EDSADC_GLOBRC_M13RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M13RUN */
#define IFX_EDSADC_GLOBRC_M13RUN_OFF (29u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_MSK (0x1u)

