zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEdsadc_bf.h
/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_OFF (0u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_OFF (1u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_OFF (2u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_OFF (3u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_OFF (4u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_OFF (5u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_OFF (6u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG07 */
#define IFX_EDSADC_ACCPROT_RG07_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG07 */
#define IFX_EDSADC_ACCPROT_RG07_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG07 */
#define IFX_EDSADC_ACCPROT_RG07_OFF (7u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG10 */
#define IFX_EDSADC_ACCPROT_RG10_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG10 */
#define IFX_EDSADC_ACCPROT_RG10_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG10 */
#define IFX_EDSADC_ACCPROT_RG10_OFF (16u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RGG */
#define IFX_EDSADC_ACCPROT_RGG_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RGG */
#define IFX_EDSADC_ACCPROT_RGG_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RGG */
#define IFX_EDSADC_ACCPROT_RGG_OFF (31u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.CGMOD */
#define IFX_EDSADC_CGCFG_CGMOD_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.CGMOD */
#define IFX_EDSADC_CGCFG_CGMOD_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.CGMOD */
#define IFX_EDSADC_CGCFG_CGMOD_OFF (0u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.BREV */
#define IFX_EDSADC_CGCFG_BREV_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.BREV */
#define IFX_EDSADC_CGCFG_BREV_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.BREV */
#define IFX_EDSADC_CGCFG_BREV_OFF (2u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.SIGPOL */
#define IFX_EDSADC_CGCFG_SIGPOL_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.SIGPOL */
#define IFX_EDSADC_CGCFG_SIGPOL_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.SIGPOL */
#define IFX_EDSADC_CGCFG_SIGPOL_OFF (3u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.DIVCG */
#define IFX_EDSADC_CGCFG_DIVCG_LEN (4u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.DIVCG */
#define IFX_EDSADC_CGCFG_DIVCG_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.DIVCG */
#define IFX_EDSADC_CGCFG_DIVCG_OFF (4u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.RUN */
#define IFX_EDSADC_CGCFG_RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.RUN */
#define IFX_EDSADC_CGCFG_RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.RUN */
#define IFX_EDSADC_CGCFG_RUN_OFF (15u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.BITCOUNT */
#define IFX_EDSADC_CGCFG_BITCOUNT_LEN (5u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.BITCOUNT */
#define IFX_EDSADC_CGCFG_BITCOUNT_MSK (0x1fu)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.BITCOUNT */
#define IFX_EDSADC_CGCFG_BITCOUNT_OFF (16u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_EDSADC_CGCFG_STEPCOUNT_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_EDSADC_CGCFG_STEPCOUNT_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.STEPCOUNT */
#define IFX_EDSADC_CGCFG_STEPCOUNT_OFF (24u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.STEPS */
#define IFX_EDSADC_CGCFG_STEPS_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.STEPS */
#define IFX_EDSADC_CGCFG_STEPS_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.STEPS */
#define IFX_EDSADC_CGCFG_STEPS_OFF (28u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.STEPD */
#define IFX_EDSADC_CGCFG_STEPD_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.STEPD */
#define IFX_EDSADC_CGCFG_STEPD_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.STEPD */
#define IFX_EDSADC_CGCFG_STEPD_OFF (29u)

/** \brief Length for Ifx_EDSADC_CGCFG_Bits.SGNCG */
#define IFX_EDSADC_CGCFG_SGNCG_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CGCFG_Bits.SGNCG */
#define IFX_EDSADC_CGCFG_SGNCG_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CGCFG_Bits.SGNCG */
#define IFX_EDSADC_CGCFG_SGNCG_OFF (30u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV0 */
#define IFX_EDSADC_EVFLAG_RESEV0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV0 */
#define IFX_EDSADC_EVFLAG_RESEV0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV0 */
#define IFX_EDSADC_EVFLAG_RESEV0_OFF (0u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV1 */
#define IFX_EDSADC_EVFLAG_RESEV1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV1 */
#define IFX_EDSADC_EVFLAG_RESEV1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV1 */
#define IFX_EDSADC_EVFLAG_RESEV1_OFF (1u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV2 */
#define IFX_EDSADC_EVFLAG_RESEV2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV2 */
#define IFX_EDSADC_EVFLAG_RESEV2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV2 */
#define IFX_EDSADC_EVFLAG_RESEV2_OFF (2u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV3 */
#define IFX_EDSADC_EVFLAG_RESEV3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV3 */
#define IFX_EDSADC_EVFLAG_RESEV3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV3 */
#define IFX_EDSADC_EVFLAG_RESEV3_OFF (3u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV4 */
#define IFX_EDSADC_EVFLAG_RESEV4_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV4 */
#define IFX_EDSADC_EVFLAG_RESEV4_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV4 */
#define IFX_EDSADC_EVFLAG_RESEV4_OFF (4u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV5 */
#define IFX_EDSADC_EVFLAG_RESEV5_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV5 */
#define IFX_EDSADC_EVFLAG_RESEV5_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV5 */
#define IFX_EDSADC_EVFLAG_RESEV5_OFF (5u)

