zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxEdsadc_bf.h
/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV6 */
#define IFX_EDSADC_EVFLAG_RESEV6_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV6 */
#define IFX_EDSADC_EVFLAG_RESEV6_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV6 */
#define IFX_EDSADC_EVFLAG_RESEV6_OFF (6u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV7 */
#define IFX_EDSADC_EVFLAG_RESEV7_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV7 */
#define IFX_EDSADC_EVFLAG_RESEV7_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV7 */
#define IFX_EDSADC_EVFLAG_RESEV7_OFF (7u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV8 */
#define IFX_EDSADC_EVFLAG_RESEV8_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV8 */
#define IFX_EDSADC_EVFLAG_RESEV8_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV8 */
#define IFX_EDSADC_EVFLAG_RESEV8_OFF (8u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV9 */
#define IFX_EDSADC_EVFLAG_RESEV9_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV9 */
#define IFX_EDSADC_EVFLAG_RESEV9_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV9 */
#define IFX_EDSADC_EVFLAG_RESEV9_OFF (9u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV10 */
#define IFX_EDSADC_EVFLAG_RESEV10_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV10 */
#define IFX_EDSADC_EVFLAG_RESEV10_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV10 */
#define IFX_EDSADC_EVFLAG_RESEV10_OFF (10u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV11 */
#define IFX_EDSADC_EVFLAG_RESEV11_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV11 */
#define IFX_EDSADC_EVFLAG_RESEV11_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV11 */
#define IFX_EDSADC_EVFLAG_RESEV11_OFF (11u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV12 */
#define IFX_EDSADC_EVFLAG_RESEV12_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV12 */
#define IFX_EDSADC_EVFLAG_RESEV12_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV12 */
#define IFX_EDSADC_EVFLAG_RESEV12_OFF (12u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.RESEV13 */
#define IFX_EDSADC_EVFLAG_RESEV13_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.RESEV13 */
#define IFX_EDSADC_EVFLAG_RESEV13_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.RESEV13 */
#define IFX_EDSADC_EVFLAG_RESEV13_OFF (13u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV0 */
#define IFX_EDSADC_EVFLAG_ALEV0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV0 */
#define IFX_EDSADC_EVFLAG_ALEV0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV0 */
#define IFX_EDSADC_EVFLAG_ALEV0_OFF (16u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV1 */
#define IFX_EDSADC_EVFLAG_ALEV1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV1 */
#define IFX_EDSADC_EVFLAG_ALEV1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV1 */
#define IFX_EDSADC_EVFLAG_ALEV1_OFF (17u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV2 */
#define IFX_EDSADC_EVFLAG_ALEV2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV2 */
#define IFX_EDSADC_EVFLAG_ALEV2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV2 */
#define IFX_EDSADC_EVFLAG_ALEV2_OFF (18u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV3 */
#define IFX_EDSADC_EVFLAG_ALEV3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV3 */
#define IFX_EDSADC_EVFLAG_ALEV3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV3 */
#define IFX_EDSADC_EVFLAG_ALEV3_OFF (19u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV4 */
#define IFX_EDSADC_EVFLAG_ALEV4_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV4 */
#define IFX_EDSADC_EVFLAG_ALEV4_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV4 */
#define IFX_EDSADC_EVFLAG_ALEV4_OFF (20u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV5 */
#define IFX_EDSADC_EVFLAG_ALEV5_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV5 */
#define IFX_EDSADC_EVFLAG_ALEV5_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV5 */
#define IFX_EDSADC_EVFLAG_ALEV5_OFF (21u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV6 */
#define IFX_EDSADC_EVFLAG_ALEV6_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV6 */
#define IFX_EDSADC_EVFLAG_ALEV6_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV6 */
#define IFX_EDSADC_EVFLAG_ALEV6_OFF (22u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV7 */
#define IFX_EDSADC_EVFLAG_ALEV7_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV7 */
#define IFX_EDSADC_EVFLAG_ALEV7_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV7 */
#define IFX_EDSADC_EVFLAG_ALEV7_OFF (23u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV8 */
#define IFX_EDSADC_EVFLAG_ALEV8_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV8 */
#define IFX_EDSADC_EVFLAG_ALEV8_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV8 */
#define IFX_EDSADC_EVFLAG_ALEV8_OFF (24u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV9 */
#define IFX_EDSADC_EVFLAG_ALEV9_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV9 */
#define IFX_EDSADC_EVFLAG_ALEV9_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV9 */
#define IFX_EDSADC_EVFLAG_ALEV9_OFF (25u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV10 */
#define IFX_EDSADC_EVFLAG_ALEV10_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV10 */
#define IFX_EDSADC_EVFLAG_ALEV10_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV10 */
#define IFX_EDSADC_EVFLAG_ALEV10_OFF (26u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV11 */
#define IFX_EDSADC_EVFLAG_ALEV11_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV11 */
#define IFX_EDSADC_EVFLAG_ALEV11_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAG_Bits.ALEV11 */
#define IFX_EDSADC_EVFLAG_ALEV11_OFF (27u)

/** \brief Length for Ifx_EDSADC_EVFLAG_Bits.ALEV12 */
#define IFX_EDSADC_EVFLAG_ALEV12_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAG_Bits.ALEV12 */
#define IFX_EDSADC_EVFLAG_ALEV12_MSK (0x1u)

